# Taps
tap "homebrew/cask-versions"

# Binaries
brew "cask"
brew "fzf"
brew "z"
brew "zsh-autosuggestions"
brew "shfmt"
brew "tmux"
brew "lua"
brew "neovim"
brew "ack"
brew "node", link: :overwrite
brew "python@3.13", link: :overwrite
brew "pipx"
brew "ruby", link: :overwrite
brew "ripgrep"
brew "git"
brew "tig"
brew "tree"
brew "jq"
brew "yq"
brew "expect"
brew "just"
brew "ffmpeg"
brew "telnet"

# Development
#brew "protobuf"
#brew "buf"
brew "lcov"
brew "gcov"
# - Arduino
brew "arduino-cli"
cask "arduino-ide"
cask "saleae-logic"
# - Nordic
brew "doxygen"
cask "segger-jlink"
cask "segger-embedded-studio-for-arm"
cask "nordic-nrf-command-line-tools"
cask "nordic-nrf-connect"
# - Android
#brew "openjdk@11", postinstall: "sudo ln -sfn /usr/local/opt/openjdk@11/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk-11.jdk"
#brew "openjdk@17", postinstall: "sudo ln -sfn /usr/local/opt/openjdk@17/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk-17.jdk"
#brew "maven"
#brew "gradle"
#cask "android-sdk"
#cask "android-studio"
#brew "srccpy"
#brew "pidcat"
# - iOS
brew "aria2"
brew "xcodes"
#brew "swift-protobuf"
# - Flutter
#brew "fvm"
# - Python
#cask "pycharm-ce"
# - Misc
cask "visual-studio-code"
cask "zed"
cask "google-cloud-sdk", postinstall: "${HOMEBREW_PREFIX}/bin/gcloud components update"
cask "docker"

# - VSCode extensions
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-serial-monitor"
vscode "vscode-arduino.vscode-arduino-community"
vscode "vscodevim.vim"

# Apps
cask "logi-options+"
cask "arc"
cask "rectangle"
cask "flycut"
cask "ghostty"
cask "github"
cask "kicad"
cask "slack"
#cask "gimp"
#cask "figma"
cask "stats"
cask "displaylink"
#cask "sonos"
#cask "spotify"
